meshtastic/firmware/src/platform/nrf52/NRF52RtttlTicker.cpp
#include "NRF52RtttlTicker.h"

#ifdef ARCH_NRF52

#include "DebugConfiguration.h"
#include "freertosinc.h"
#include <NonBlockingRtttl.h>
#include <timers.h>

namespace NRF52RtttlTicker
{
namespace
{
// The stall this works around is tens of milliseconds, so 5 ms is inaudible and keeps the timer
// daemon at 200 wakeups/s. Must stay above one tick (configTICK_RATE_HZ is 1024 here) or
// pdMS_TO_TICKS() rounds to zero, xTimerCreate() fails, and we silently drop back to polling.
constexpr uint32_t kTickMs = 5;
static_assert(kTickMs * configTICK_RATE_HZ >= 1000, "kTickMs rounds to zero ticks");

TimerHandle_t timer = nullptr;
SemaphoreHandle_t lock = nullptr;
// True only while the timer is servicing a song; pump() polls from the main loop whenever it is not.
bool timerRunning = false;
bool reportedInitFailure = false;
bool reportedStackMargin = false;

void onTick(TimerHandle_t)
{
    // The main thread holds the lock only across begin()/stop(); skip this tick rather than block the timer task.
    if (xSemaphoreTake(lock, 0) != pdTRUE)
        return;
    if (rtttl::isPlaying()) {
        rtttl::play();
    } else {
        // onTick -> rtttl::play -> tone -> applyConfiguration is the deepest chain on the timer
        // daemon's 1 KB stack, which is shared with Bluefruit. Report the margin once per boot.
        if (!reportedStackMargin) {
            reportedStackMargin = true;
            LOG_DEBUG("RTTTL timer daemon stack free: %u words",
                      (unsigned)uxTaskGetStackHighWaterMark(xTimerGetTimerDaemonTaskHandle()));
        }
        xTimerStop(timer, 0); // song finished on its own
    }
    xSemaphoreGive(lock);
}

bool ensureInit()
{
    if (timer)
        return true;
    if (!lock)
        lock = xSemaphoreCreateMutex();
    if (lock)
        timer = xTimerCreate("rtttl", pdMS_TO_TICKS(kTickMs), pdTRUE, nullptr, onTick);
    if (!timer && !reportedInitFailure) {
        // begin() runs again on every nag restart, so only complain the first time.
        reportedInitFailure = true;
        LOG_ERROR("RTTTL timer unavailable, falling back to main-loop playback");
    }
    return timer != nullptr;
}
} // namespace

void begin(uint8_t pin, const char *song)
{
    if (!ensureInit()) {
        rtttl::begin(pin, song);
        return;
    }
    xSemaphoreTake(lock, portMAX_DELAY);
    rtttl::begin(pin, song);
    xSemaphoreGive(lock);
    // A start rejected by a full timer command queue must fall back to polling, or the song never advances.
    timerRunning = xTimerStart(timer, pdMS_TO_TICKS(10)) == pdPASS;
    if (!timerRunning)
        LOG_WARN("RTTTL timer start rejected, falling back to main-loop playback");
}

void pump()
{
    if (!timerRunning && rtttl::isPlaying())
        rtttl::play();
}

void stop()
{
    if (!timer) {
        rtttl::stop();
        return;
    }
    // Unlike the start, a rejected stop is harmless: rtttl::stop() below clears the playing flag,
    // so the next onTick() stops the timer itself.
    (void)xTimerStop(timer, pdMS_TO_TICKS(10));
    timerRunning = false;
    xSemaphoreTake(lock, portMAX_DELAY);
    rtttl::stop();
    xSemaphoreGive(lock);
}
} // namespace NRF52RtttlTicker

#endif
